// მოთხოვნის გაგზავნა მითითებულ მისამართზე fetch() ფუნქციით
fetch("https://jsonplaceholder.typicode.com/posts")
  .then((response) => {
    // JSON ფორმატის მონაცემების მიღება
    return response.json();
  })
  .then((data) => {
    // მონაცემების კონსოლში დაბეჭდვა
    console.log("მონაცემები წარმატებით დავბეჭდეთ:", data);
  })
  .catch((error) => {
    // შეცდომის გამართვა
    console.error("შეცდომა მოთხოვნის პროცესში:", error);
  });

console.log(fetch("https://jsonplaceholder.typicode.com/posts")); 
// ეს პირდაპირ დააბრუნებს დაპირების ობიექტს


//JSON არის მონაცემთა ფორმატი, რომელიც გამოიყენება სერვერსა და
//  კლიენტს შორის მონაცემების გადაცემისთვის. ის წააგავს JavaScript
//  ობიექტს და მარტივია წაკითხვისთვის.


//json() მეთოდი ასინქრონულია, რადგან სერვერიდან დაბრუნებული მონაცემები
//  შეიძლება იყოს დიდი ზომის და მათი პარსინგი 
//  დრო მოითხოვს. ასინქრონიზაციით ბრაუზერი არ ჩერდება დa
//  სხვა ოპერაციები განაგრძობს მუშაობას, სანამ მონაცემების დამუშავება დასრულდება.
